// 自動生成されたコードです。変更しないでください。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image2":
            case "HONE":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. 1 . . . . . . . . 1 . . . . . 
1 1 1 . . . . . . 1 1 1 . . . . 
. 1 1 1 1 1 1 1 1 1 1 . . . . . 
. 1 1 1 1 1 1 1 1 1 1 . . . . . 
1 1 1 . . . . . . 1 1 1 . . . . 
. 1 . . . . . . . . 1 . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image1":
            case "INNU":return img`
. . . . . . . 1 . 1 1 1 1 . 1 . 
. . . . . . . 1 1 1 1 1 1 1 1 . 
. . . . . . 1 1 1 1 1 1 1 1 1 . 
. . . . . . 1 1 1 1 f 1 1 f 1 1 
1 . 2 2 2 2 1 1 1 1 1 1 1 1 1 1 
1 . 2 2 2 2 1 1 1 1 1 f f 1 1 1 
1 1 2 2 2 2 2 2 1 f 1 f 1 1 f 1 
1 1 2 2 2 2 2 2 2 1 f f f f 1 1 
1 1 2 2 2 2 2 2 2 2 1 1 1 1 1 2 
1 1 1 1 2 2 2 2 2 2 2 2 2 2 2 1 
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 
. 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 
. 1 1 . 1 1 . . . . 1 1 . 1 1 . 
. 1 1 . 1 1 . . . . 1 1 . 1 . . 
. 1 . . 1 . . . . . 1 . . . . . 
`;
            case "image3":
            case "KUMO":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . f . . . . . f . . . . . 
. . . f f f . . . f f f . . . . 
. . . f f f f f f f f f . . . . 
. . f f f f f f f f f f f . . . 
. . f f 1 1 f f f 1 1 f f . . . 
. . f f 1 1 f f f 1 1 f f . . . 
. . f f f f f f f f f f f . . . 
. . . f f f f 1 f f f f . . . . 
. . . . f f f f f f f . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
